_orgs/_posts/database/2017-04-11-sql-server.org
#+TITLE:     SQL-Server Notes
#+AUTHOR:    赵仁贵
#+EMAIL:     zrg1390556487@gmail.com
#+LANGUAGE:  cn
#+OPTIONS:   H:3 num:t toc:nil \n:nil @:t ::t |:t ^:nil -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:plain toc:t ltoc:t mouse:underline buttons:0 path:http://cs3.swfc.edu.cn/~20121156044/.org-info.js />
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="http://cs3.swfu.edu.cn/~20121156044/.org-manual.css" />
#+HTML_HEAD_EXTRA: <style>body {font-size:14pt} code {font-weight:bold;font-size:100%; color:darkblue}</style>
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:   
#+LINK_HOME: 
#+XSLT: 

#+BEGIN_EXPORT HTML                                                                              
---
layout: post
title: Use SQL-Server
author: zrg
comments: false                                                                                  
description: SQL-Server 使用笔记
categories:
- datebase
tags: 
- SQL-Server
- SQL-Server-2018
- SQL-Server-2018-R2
photos: 
---
#+END_EXPORT

# (setq org-export-html-use-infojs nil)
# (setq org-export-html-style nil)

* SQL server 2008 R2数据迁移到2008
** 情况描述
: 今天，特意查阅了一下为什么在sql server 2008 R2上建的数据库迁移到sql server 2008上就出错,问题的关键在于如何保留原有表结构的主键、外键等，分两个情况，对于数据库数据量小的，可以很方便的解决。
** 第一种：小数据的情况
: 1.先在低版本的服务器上建立同名的数据库.
: 2.在高版本的服务器上右键点击目标数据库->任务->生成脚本. 
: 3.在选择对象->选择特定数据库对象.
: 4.选择表、视图、存储过程，然后下一步.
: 5.关键在这，这一步里，请选择”高级“，选项里选择[编写DROP和Create脚本]项的”编写DROP和Create脚本“.
: 6.选择服务器数据库版本.
: 7.选择[编写脚本和数据类型]项的“架构和数据".
: 8.保存脚本,在低版本的数据库下执行脚本即可.
** 第二种：大数据的情况
: 按理应该也可以通过类似包含架构和数据的方式来做，但是由于包含大数据的时候脚本文件太大，无法在分析器里执行，所以我们得绕一下.
: 1~4. 1～4步和a情况相同.
: 5.这步我们选择”高级“，选项里选择[编写DROP和Create脚本]项的”编写DROP和Create脚本“，以及[为服务器版本编写脚本]项的
: sql server 2008(具体看数据库的版本)，最后选[编写脚本和数据类型]项的“架构".
: 6.保存脚本.
: 7.在低版本的数据下执行脚本，注意（ALTER TABLE 表名 WITH CHECK ADD CONSTRAINT [外键名] FOREIGN KEY(字段)REFERENCES表名(字段))
: 这个先不要执行.
: 8.现在可以通过导入导出任务先将表的内容导入到低版本的数据库内.
: 9.再执行脚本内（ALTER TABLE 表名 WITH CHECK ADD CONSTRAINT [外键名] FOREIGN KEY(字段) REFERENCES 表名(字段))这样的语句，此
: 处将表的外键附加上.
