_posts/database/2017-04-11-sql-server.html
---
layout: post
title: SQL-Server 使用笔记
author: zrg
comments: false                                                                                  
description: SQL-Server 使用笔记
categories:
- database
tags: 
- SQL-Server
- SQL-Server-2008
- SQL-Server-2008-R2
photos: 
---

<div id="outline-container-org8744430" class="outline-2">
<h2 id="org8744430"><span class="section-number-2">1</span> SQL server 2008 R2数据迁移到2008</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org700f4c7" class="outline-3">
<h3 id="org700f4c7"><span class="section-number-3">1.1</span> 情况描述</h3>
<div class="outline-text-3" id="text-1-1">
<pre class="example">
今天，特意查阅了一下为什么在sql server 2008 R2上建的数据库迁移到sql server 2008上就出错,问题的关键在于如何保留原有表结构的主键、外键等，分两个情况，对于数据库数据量小的，可以很方便的解决。
</pre>
</div>
</div>
<div id="outline-container-orgd33ce9f" class="outline-3">
<h3 id="orgd33ce9f"><span class="section-number-3">1.2</span> 第一种：小数据的情况</h3>
<div class="outline-text-3" id="text-1-2">
<ol class="org-ol">
<li>先在低版本的服务器上建立同名的数据库.</li>
<li>在高版本的服务器上右键点击目标数据库-&gt;任务-&gt;生成脚本.</li>
<li>在选择对象-&gt;选择特定数据库对象.</li>
<li>选择表、视图、存储过程，然后下一步.</li>
<li>关键在这，这一步里，请选择”高级“，选项里选择[编写DROP和Create脚本]项的”编写DROP和Create脚本“.</li>
<li>选择服务器数据库版本.</li>
<li>选择[编写脚本和数据类型]项的“架构和数据".</li>
<li>保存脚本,在低版本的数据库下执行脚本即可.</li>
</ol>
</div>
</div>
<div id="outline-container-orgaa452dd" class="outline-3">
<h3 id="orgaa452dd"><span class="section-number-3">1.3</span> 第二种：大数据的情况</h3>
<div class="outline-text-3" id="text-1-3">
<pre class="example">
按理应该也可以通过类似包含架构和数据的方式来做，但是由于包含大数据的时候脚本文件太大，无法在分析器里执行，所以我们得绕一下.
</pre>

<ol class="org-ol">
<li>1～4步和小数据情况相同.</li>
<li>这步我们选择”高级“，选项里选择[编写DROP和Create脚本]项的”编写DROP和Create脚本“，以及[为服务器版本编写脚本] sql server 2008(具体看数据库的版本)，最后选[编写脚本和数据类型]项的“架构".</li>
<li>保存脚本.</li>
<li>在低版本的数据下执行脚本，注意（ALTER TABLE 表名 WITH CHECK ADD CONSTRAINT [外键名] FOREIGN KEY(字段)REFERENCES表名(字段))这个先不要执行.</li>
<li>现在可以通过导入导出任务先将表的内容导入到低版本的数据库内.</li>
<li>再执行脚本内（ALTER TABLE 表名 WITH CHECK ADD CONSTRAINT [外键名] FOREIGN KEY(字段) REFERENCES 表名(字段))这样的语句，此处将表的外键附加上.</li>
</ol>
</div>
</div>
</div>
